### Note
* Instructions have been included for each segment. You do not have to follow them exactly, but they are included to help you think through the steps.

In [6]:
# Dependencies and Setup
import pandas as pd

# File to Load (Remember to Change These)
HeroesOfPymoli_Resources_purchase_data = "Resources/HeroesOfPymoli_Resources_purchase_data.csv"

# Read Purchasing File and store into Pandas data frame
purchase_data = pd.read_csv(HeroesOfPymoli_Resources_purchase_data)

In [5]:
# Dependencies and Setup
import pandas as pd

# File to Load (Remember to Change These)
file_to_load = "Resources/# Dependencies and Setup
import pandas as pd


# Read Purchasing File and store into Pandas data frame
purchase_data = pd.read_csv(file_to_load).csv"

SyntaxError: EOL while scanning string literal (<ipython-input-5-6509d8d1f6d0>, line 5)

In [16]:
purchase_data.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56
2,2,Ithergue48,24,Male,92,Final Critic,4.88
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27
4,4,Iskosia90,23,Male,131,Fury,1.44

In [3]:
purchase_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 780 entries, 0 to 779
Data columns (total 7 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   Purchase ID  780 non-null    int64
 1   SN           780 non-null    object
 2   Age          780 non-null    int64
 3   Gender       780 non-null    object
 4   Item ID      780 non-null    int64
 5   Item Name    780 non-null    object
 6   Price        780 non-null    float64
dtypes: float64(1), int64(3), object(3)
memory usage: 42.8+ KB

## Player Count

* Display the total number of players

   Total Players
0            576

In [7]:
Total_Players=len(purchase_data['SN'].unique())
Total_Players_df=pd.DataFrame({"Total Players":[Total_Players]})
Total_Players_df

   Total Players
0            576

## Purchasing Analysis (Total)

* Run basic calculations to obtain number of unique items, average price, etc.


* Create a summary data frame to hold the results


* Optional: give the displayed data cleaner formatting


* Display the summary data frame

   Number of Unique Items Average Price Number of Purchases Total Revenue
0                     179         $3.05                 780     $2,379.77

In [45]:
#Number of unique SN 
Total_SN=len(purchase_data['Item ID'].unique())
Total_SN

179

In [36]:
Average_Price=purchase_data['Price'].mean()
Average_Price

3.0509871794871795

In [27]:
Number_Purchases=purchase_data['Purchase ID'].count()
Number_Purchases

780

In [18]:
Total_Revenue=purchase_data['Price'].sum()
Total_Revenue

2379.77

In [46]:
Summary_dict=[{"Number of unique Items":Total_SN,"Average_Price":Average_Price,"Number_Purchases":Number_Purchases,"Sum_Purchases":Total_Revenue}]
Summary_df=pd.DataFrame(Summary_dict)
Summary_df

   Number of unique Items  Average_Price  Number_Purchases  Sum_Purchases
0                     179       3.050987               780        2379.77

## Gender Demographics

* Percentage and Count of Male Players


* Percentage and Count of Female Players


* Percentage and Count of Other / Non-Disclosed

                       Total Count Percentage of Players
Male                           484                84.03%
Female                          81                14.06%
Other / Non-Disclosed           11                 1.91%

In [55]:
purchase_data[["SN","Gender"]]
Gender_df=purchase_data.drop_duplicates("SN",keep='first')
count=Gender_df["Gender"].value_counts()
count

Male                     484
Female                    81
Other / Non-Disclosed     11
Name: Gender, dtype: int64

In [62]:
purchase_data[["SN","Gender"]]
Gender_df=purchase_data.drop_duplicates("SN",keep='first')
percent_count=Gender_df["Gender"].value_counts(normalize=True)
percent_count

Male                     0.840278
Female                   0.140625
Other / Non-Disclosed    0.019097
Name: Gender, dtype: float64

In [110]:
purchase_data[["SN","Gender"]]
Gender_df=purchase_data.drop_duplicates("SN",keep='first')
gender_count = pd.DataFrame({"Total Count": Gender_df["Gender"].value_counts(), "Percentage of Players": Gender_df["Gender"].value_counts(normalize=True)})
gender_count

                       Total Count  Percentage of Players
Male                           484               0.840278
Female                          81               0.140625
Other / Non-Disclosed           11               0.019097


## Purchasing Analysis (Gender)

* Run basic calculations to obtain purchase count, avg. purchase price, avg. purchase total per person etc. by gender




* Create a summary data frame to hold the results


* Optional: give the displayed data cleaner formatting


* Display the summary data frame

,Purchase Count,Average Purchase Price,Total Purchase Value,Avg Total Purchase per Person
Gender,,,,
Female,113,$3.20,$361.94,$4.47
Male,652,$3.02,"$1,967.64",$4.07
Other / Non-Disclosed,15,$3.35,$50.19,$4.56

In [85]:
purchase_count=purchase_data["Gender"].value_counts()
purchase_count

Male                     652
Female                   113
Other / Non-Disclosed     15
Name: Gender, dtype: int64

In [87]:
grouped_gender_df=purchase_data.groupby(['Gender'])
print(grouped_gender_df)
grouped_gender_df.count().head(10)

<pandas.core.groupby.generic.DataFrameGroupBy object at 0x000002298BCE9940>

                       Purchase ID   SN  Age  Item ID  Item Name  Price
Gender
Female                         113  113  113      113        113    113
Male                           652  652  652      652        652    652
Other / Non-Disclosed           15   15   15       15         15     15

In [137]:
Average_Price=grouped_gender_df["Price"].mean()
Average_Price

Gender
Female                   3.203009
Male                     3.017853
Other / Non-Disclosed    3.346000
Name: Price, dtype: float64

In [104]:
Total_Price=grouped_gender_df["Price"].sum()
Total_Price

Gender
Female                    361.94
Male                     1967.64
Other / Non-Disclosed      50.19
Name: Price, dtype: float64

In [113]:
purchase_data[["SN","Gender"]]
Gender_df=purchase_data.drop_duplicates("SN",keep='first')
gender_count = Gender_df["Gender"].value_counts()
Average_perPerson=Total_Price/gender_count
print(Average_perPerson)

Female                   4.468395
Male                     4.065372
Other / Non-Disclosed    4.562727
dtype: float64

In [114]:
purchas_gender_count = pd.DataFrame(
    {"Purchase Count": purchase_count,"Average Purchase price": Average_Price,"Total purchase Value":Total_Price,"Avg Total Purchase per Person":Average_perPerson})
purchas_gender_count

,Purchase Count,Average Purchase price,Total purchase Value,Avg Total Purchase per Person
Female,113,3.203009,361.94,4.468395
Male,652,3.017853,1967.64,4.065372
Other / Non-Disclosed,15,3.346000,50.19,4.562727

## Age Demographics

* Establish bins for ages


* Categorize the existing players using the age bins. Hint: use pd.cut()


* Calculate the numbers and percentages by age group


* Create a summary data frame to hold the results


* Optional: round the percentage column to two decimal points


* Display Age Demographics Table

       Total Count Percentage of Players
<10             17                 2.95%
10-14           22                 3.82%
15-19          107                18.58%
20-24          258                44.79%
25-29           77                13.37%
30-34           52                 9.03%
35-39           31                 5.38%
40+             12                 2.08%

In [131]:
bins=[0,9,14,19,24,29,34,39,100]
labels=["<10","10-14","15-19","20-24","25-29","30-34","35-39","40+"]
purchase_data["age group"]=pd.cut(purchase_data["Age"],bins,labels=labels,include_lowest=True)
purchase_data.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price,age group
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53,20-24
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56,40+
2,2,Ithergue48,24,Male,92,Final Critic,4.88,20-24
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27,20-24
4,4,Iskosia90,23,Male,131,Fury,1.44,20-24

In [182]:
purchase_data["age group"]
purchase_data[["SN","age group"]]
Agedemo_df=purchase_data.drop_duplicates("SN",keep='first')
Agedemo_count = pd.DataFrame({"Total Count": Agedemo_df["age group"].value_counts(), "Percentage of Players": Agedemo_df["age group"].value_counts(normalize=True)})
Agedemo_count=Agedemo_count.sort_index()
Agedemo_count

       Total Count  Percentage of Players
<10             17               0.029514
10-14           22               0.038194
15-19          107               0.185764
20-24          258               0.447917
25-29           77               0.133681
30-34           52               0.090278
35-39           31               0.053819
40+             12               0.020833

## Purchasing Analysis (Age)

* Bin the purchase_data data frame by age


* Run basic calculations to obtain purchase count, avg. purchase price, avg. purchase total per person etc. in the table below


* Create a summary data frame to hold the results


* Optional: give the displayed data cleaner formatting


* Display the summary data frame

,Purchase Count,Average Purchase Price,Total Purchase Value,Avg Total Purchase per Person
Age Ranges,,,,
<10,23,$3.35,$77.13,$4.54
10-14,28,$2.96,$82.78,$3.76
15-19,136,$3.04,$412.89,$3.86
20-24,365,$3.05,"$1,114.06",$4.32
25-29,101,$2.90,$293.00,$3.81
30-34,73,$2.93,$214.00,$4.12
35-39,41,$3.60,$147.67,$4.76
40+,13,$2.94,$38.24,$3.19

In [140]:
bins=[0,9,14,19,24,29,34,39,100]
labels=["<10","10-14","15-19","20-24","25-29","30-34","35-39","40+"]
purchase_data["age group"]=pd.cut(purchase_data["Age"],bins,labels=labels,include_lowest=True)
purchase_data.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price,age group
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53,20-24
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56,40+
2,2,Ithergue48,24,Male,92,Final Critic,4.88,20-24
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27,20-24
4,4,Iskosia90,23,Male,131,Fury,1.44,20-24

In [141]:
purchase_age_count=purchase_data["age group"].value_counts()
purchase_age_count

20-24    365
15-19    136
25-29    101
30-34     73
35-39     41
10-14     28
<10       23
40+       13
Name: age group, dtype: int64

In [150]:
grouped_age_df=purchase_data.groupby(['age group'])
print(grouped_age_df)
grouped_age_df.count().head(10)

<pandas.core.groupby.generic.DataFrameGroupBy object at 0x000002298BDCD208>

           Purchase ID   SN  Age  Gender  Item ID  Item Name  Price
age group
<10                 23   23   23      23       23         23     23
10-14               28   28   28      28       28         28     28
15-19              136  136  136     136      136        136    136
20-24              365  365  365     365      365        365    365
25-29              101  101  101     101      101        101    101
30-34               73   73   73      73       73         73     73
35-39               41   41   41      41       41         41     41
40+                 13   13   13      13       13         13     13

In [151]:
Average_age_Price=grouped_age_df["Price"].mean()
Average_age_Price

age group
<10      3.353478
10-14    2.956429
15-19    3.035956
20-24    3.052219
25-29    2.900990
30-34    2.931507
35-39    3.601707
40+      2.941538
Name: Price, dtype: float64

In [152]:
Total_age_Price=grouped_age_df["Price"].sum()
Total_age_Price

age group
<10        77.13
10-14      82.78
15-19     412.89
20-24    1114.06
25-29     293.00
30-34     214.00
35-39     147.67
40+        38.24
Name: Price, dtype: float64

In [159]:
purchase_data[["SN","age group"]]
age_df=purchase_data.drop_duplicates("SN",keep='first')
age_count = age_df["age group"].value_counts()
Average_age_perPerson=Total_age_Price/age_count
print(Average_age_perPerson)

<10      4.537059
10-14    3.762727
15-19    3.858785
20-24    4.318062
25-29    3.805195
30-34    4.115385
35-39    4.763548
40+      3.186667
dtype: float64

In [161]:
purchas_age_count = pd.DataFrame(
    {"Purchase Count": purchase_age_count,"Average Purchase price": Average_age_Price,"Total purchase Value":Total_age_Price,"Avg Total Purchase per Person":Average_age_perPerson})
purchas_age_count

,Purchase Count,Average Purchase price,Total purchase Value,Avg Total Purchase per Person
<10,23,3.353478,77.13,4.537059
10-14,28,2.956429,82.78,3.762727
15-19,136,3.035956,412.89,3.858785
20-24,365,3.052219,1114.06,4.318062
25-29,101,2.900990,293.00,3.805195
30-34,73,2.931507,214.00,4.115385
35-39,41,3.601707,147.67,4.763548
40+,13,2.941538,38.24,3.186667

## Top Spenders

* Run basic calculations to obtain the results in the table below


* Create a summary data frame to hold the results


* Sort the total purchase value column in descending order


* Optional: give the displayed data cleaner formatting


* Display a preview of the summary data frame

             Purchase Count Average Purchase Price Total Purchase Value
SN
Lisosia93                 5                  $3.79               $18.96
Idastidru52               4                  $3.86               $15.45
Chamjask73                3                  $4.61               $13.83
Iral74                    4                  $3.40               $13.62
Iskadarya95               3                  $4.37               $13.10

In [163]:
purchase_top_count=purchase_data["SN"].value_counts()
purchase_top_count

Lisosia93      5
Iral74         4
Idastidru52    4
Aina42         3
Lisim78        3
              ..
Minduli80      1
Ealiril69      1
Ilast79        1
Irilis75       1
Mindilsa34     1
Name: SN, Length: 576, dtype: int64

In [165]:
grouped_top_df=purchase_data.groupby(['SN'])
print(grouped_top_df)
grouped_top_df.count().head(5)

<pandas.core.groupby.generic.DataFrameGroupBy object at 0x000002298BDCA4E0>

              Purchase ID  Age  Gender  Item ID  Item Name  Price  age group
SN
Adairialis76            1    1       1        1          1      1          1
Adastirin33             1    1       1        1          1      1          1
Aeda94                  1    1       1        1          1      1          1
Aela59                  1    1       1        1          1      1          1
Aelaria33               1    1       1        1          1      1          1

In [166]:
Average_top_Price=grouped_top_df["Price"].mean()
Average_top_Price

SN
Adairialis76     2.280000
Adastirin33      4.480000
Aeda94           4.910000
Aela59           4.320000
Aelaria33        1.790000
                   ...
Yathecal82       2.073333
Yathedeu43       3.010000
Yoishirrala98    4.580000
Zhisrisu83       3.945000
Zontibe81        2.676667
Name: Price, Length: 576, dtype: float64

In [167]:
Total_top_Price=grouped_top_df["Price"].sum()
Total_top_Price

SN
Adairialis76     2.28
Adastirin33      4.48
Aeda94           4.91
Aela59           4.32
Aelaria33        1.79
                 ...
Yathecal82       6.22
Yathedeu43       6.02
Yoishirrala98    4.58
Zhisrisu83       7.89
Zontibe81        8.03
Name: Price, Length: 576, dtype: float64

In [172]:
purchas_top_count = pd.DataFrame(
    {"Purchase Count": purchase_top_count,"Average Purchase price": Average_top_Price,"Total purchase Value":Total_top_Price})
purchas_top_count=purchas_top_count.sort_values("Total purchase Value",ascending=False)

purchas_top_count.head(5)

             Purchase Count  Average Purchase price  Total purchase Value
Lisosia93                 5                3.792000                 18.96
Idastidru52               4                3.862500                 15.45
Chamjask73                3                4.610000                 13.83
Iral74                    4                3.405000                 13.62
Iskadarya95               3                4.366667                 13.10

In [ ]:
purchas_top_count[""]=purchas_top_count[""].map("$:.2f".format)

## Most Popular Items

* Retrieve the Item ID, Item Name, and Item Price columns


* Group by Item ID and Item Name. Perform calculations to obtain purchase count, average item price, and total purchase value


* Create a summary data frame to hold the results


* Sort the purchase count column in descending order


* Optional: give the displayed data cleaner formatting


* Display a preview of the summary data frame

,,Purchase Count,Item Price,Total Purchase Value
Item ID,Item Name,,,
92,Final Critic,13,$4.61,$59.99
178,"Oathbreaker, Last Hope of the Breaking Storm",12,$4.23,$50.76
145,Fiery Glass Crusader,9,$4.58,$41.22
132,Persuasion,9,$3.22,$28.99
108,"Extraction, Quickblade Of Trembling Hands",9,$3.53,$31.77

In [36]:
purchase_popular_count=purchase_data['Item ID'].value_counts()
purchase_popular_count

92     13
178    12
108     9
132     9
82      9
       ..
104     1
27      1
134     1
118     1
91      1
Name: Item ID, Length: 179, dtype: int64

In [37]:
grouped_popular_df=purchase_data.groupby(['Item ID','Item Name'])
print(grouped_popular_df)
grouped_popular_df.count().head()

<pandas.core.groupby.generic.DataFrameGroupBy object at 0x00000193014BA550>

                            Purchase ID  SN  Age  Gender  Price
Item ID Item Name
0       Splinter                      4   4    4       4      4
1       Crucifer                      4   4    4       4      4
2       Verdict                       6   6    6       6      6
3       Phantomlight                  6   6    6       6      6
4       Bloodlord's Fetish            5   5    5       5      5

In [33]:
# purchases_popular_count=grouped_popular_df["Price"].value_counts()

# purchases_popular_count

In [38]:
Average_popular_Price=grouped_popular_df["Price"].mean()
Average_popular_Price

Item ID  Item Name
0        Splinter                                        1.2800
1        Crucifer                                        2.9425
2        Verdict                                         2.4800
3        Phantomlight                                    2.4900
4        Bloodlord's Fetish                              1.7000
                                                          ...
178      Oathbreaker, Last Hope of the Breaking Storm    4.2300
179      Wolf, Promise of the Moonwalker                 4.4800
181      Reaper's Toll                                   1.6600
182      Toothpick                                       4.0300
183      Dragon's Greatsword                             1.0900
Name: Price, Length: 179, dtype: float64

In [39]:
Total_popular_Price=grouped_popular_df["Price"].sum()
Total_popular_Price

Item ID  Item Name
0        Splinter                                         5.12
1        Crucifer                                        11.77
2        Verdict                                         14.88
3        Phantomlight                                    14.94
4        Bloodlord's Fetish                               8.50
                                                         ...
178      Oathbreaker, Last Hope of the Breaking Storm    50.76
179      Wolf, Promise of the Moonwalker                 26.88
181      Reaper's Toll                                    8.30
182      Toothpick                                       12.09
183      Dragon's Greatsword                              3.27
Name: Price, Length: 179, dtype: float64

In [41]:
purchase_popular_count = pd.DataFrame(
    {"Purchase Count": purchases_popular_count,
     "Average Item price": Average_popular_Price,
     "Total purchase Value":Total_popular_Price})
purchase_popular_count=purchase_popular_count.sort_values("Total purchase Value",ascending=False)

purchase_popular_count

ValueError: operands could not be broadcast together with shapes (179,2) (3,) (179,2)

## Most Profitable Items

* Sort the above table by total purchase value in descending order


* Optional: give the displayed data cleaner formatting


* Display a preview of the data frame

,,Purchase Count,Item Price,Total Purchase Value
Item ID,Item Name,,,
92,Final Critic,13,$4.61,$59.99
178,"Oathbreaker, Last Hope of the Breaking Storm",12,$4.23,$50.76
82,Nirvana,9,$4.90,$44.10
145,Fiery Glass Crusader,9,$4.58,$41.22
103,Singed Scalpel,8,$4.35,$34.80